app/views/given_answers/index.html.erb

SELECT Tough Phone FROM `given_answers` WHERE `given_answers`.`user_id` = 1 AND ( Tough Phone )
---
<br>
<% @results = GivenAnswer.where(:user_id => current_user.id , :survey_id => params[:survey_id] ) %>