app/views/surveys/index.html.erb


  <% if current_user.id == User.first.id %>
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1