app/controllers/given_answers_controller.rb

    def new
          check = GivenAnswer.find_by(:user_id => current_user.id , :survey_id => params[:survey_id])
          if check.nil?
             @survey = Survey.find(params[:survey_id])
---
SELECT `given_answers`.* FROM `given_answers` WHERE `given_answers`.`user_id` = 1 AND `given_answers`.`survey_id` = 1 LIMIT 1
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = ? LIMIT 1  [["id", "1"]]

    def create
      raise params.inspect
          params[:given_answer].each do |question_id, given_answer_attributes|
            answer=given_answer_attributes[:answer_options]
            answer == if answer.is_a?(Array)
                stripped_answers = strip_checkbox_answers(answer)
                answer=stripped_answers.join('\n')
                else
                  answer
            end
              @attempt_questions = GivenAnswer.new(:user_id =>current_user.id , :question_id =>question_id , :survey_id => params[:survey_id] , :answer =>  answer)
              @attempt_questions.save
          end

          @survey = Survey.find(params[:survey_id])
---
INSERT INTO `given_answers` (`answer`, `created_at`, `question_id`, `survey_id`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?)  [["answer", " Male"], ["created_at", Sat, 23 Jan 2016 10:02:57 UTC +00:00], ["question_id", 1], ["survey_id", 1], ["updated_at", Sat, 23 Jan 2016 10:02:57 UTC +00:00], ["user_id", 1]]
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = ? LIMIT 1  [["id", "1"]]