app/controllers/questions_controller.rb

  def index
    #raise params.inspect
    @survey = params[:survey_id]
    @attemptsurvey = GivenAnswer.new
    @questions = Question.where(:survey_id => params[:survey_id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`survey_id` = 1

    def set_question
      @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = ? LIMIT 1  [["id", "index"]]