app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT `surveys`.* FROM `surveys`

  def show
        @survey= Survey.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    #raise params.inspect
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save
---
INSERT INTO `surveys` (`created_at`, `name`, `updated_at`) VALUES (?, ?, ?)  [["created_at", Thu, 21 Jan 2016 09:09:50 UTC +00:00], ["name", "Mobile"], ["updated_at", Thu, 21 Jan 2016 09:09:50 UTC +00:00]]